{
	"header.home": "Home",
	"header.projects": "Projects",
	"header.skills": "Skills",
	"header.works": "Work Experience",
	"header.contacts": "Contacts",
	"cont.title": "My aspiration is to achieve <br/><span>excellence</span> in everything I do.",
	"cont.subtitle": "Below are links to my social networks<br/> Or write me here - <a style={mailColor} id='mail' className='main_mail' href='mailto:taraskotovych@gmail.com'>t.kotovych@gmail.com</a>",
	"about.hello": "Hello Everyone 👋",
	"about.title": "My name is Taras<br/> I am a Front-End <span>Developer</span><Cursor />",
	"about.subtitle": "I'm a passionate Front-End Developer with a strong desire for innovation and a keen eye for detail. My journey in web development has been fueled by a deep love for creating beautiful and user-friendly interfaces. I'm dedicated to crafting efficient, responsive, and accessible websites that provide an exceptional user experience. With a background in both design and coding, I bring a unique blend of creativity and technical expertise to every project. Let's work together to turn your ideas into captivating digital experiences.",
	"about.skills": "My skills",
	"work.title": "My Experience",
	"work.description1": "In my role at «IT Global», I worked as a front-end developer for the past three years. I focused on creating user-friendly interfaces for cutting-edge web applications. My achievements include designing visually appealing web pages that enhanced user engagement and improved their experience. I collaborated effectively with cross-functional teams, including designers and back-end developers, to ensure product quality and performance. I also actively explored and implemented new technologies and practices to enhance development efficiency and ensure compatibility across various browsers and devices. My proactive and adaptable approach contributed to my professional growth and the creation of high-quality, innovative products.",
	"work.description2": "At «InfinitiTech Labs», I was a front-end developer specializing in React and Redux. My role involved turning design concepts into dynamic web interfaces. I used React to create interactive user experiences and integrated Redux for efficient state management. My work also included optimizing website performance and ensuring cross-browser and cross-device compatibility, contributing to our reputation for innovative digital solutions.",
	"work.description3": "I'm an experienced Upwork frontend developer with a successful track record spanning over a year. During this time, I've tackled a diverse range of projects, showcasing my proficiency in HTML, CSS, JavaScript, React, and Redux. My work spans from creating stunning web interfaces to optimizing existing ones. I'm committed to delivering quality results and ensuring client satisfaction. Let's leverage my expertise to accomplish your project goals.",
	"upwork.date": "10.10.2022 - present days",
	"projects.title": "My Projects",
	"projects1.subtitle":"Sign in/up Forms",
	"projects2.subtitle":"Post Publication Implementation",
	"projects3.subtitle":"Event Listener",
	"projects4.subtitle":"Simple Generator",
	"projects1.description": "In this project, I gave a simple example of the implementation of the registration/login form, which checks the availability and correctness of the entered data.",
	"projects2.description": "The project shows an example of the implementation of a possible site on which it is possible to add publications that include text, pictures, etc. The project uses Redux technology.",
	"projects3.description": "This project uses the event listener technology, which, when the corresponding key on the keyboard is pressed, the corresponding sound is played.",
	"projects4.description": "Here is a simple example of a generator with which we can generate a new index or change the font size.",
	"projects.more": "About project...",
	"projects.visit": "Visit Project",
	"sing.p1": "This project shows an example of the implementation of the registration/login form. The form checks the correctness of the entered data, remembers the registered user and, in case of inconsistency, notifies the user.",
	"sing.p2": "The form is implemented through React, using styled-components.",
	"publish.p1": "In this project, I created the ability to add posts to a page. A random amount of likes, comments, and shares is also added to the post. When you click on each of them, the number will increase by 1, when you click again, it will decrease.",
	"publish.p2": "Here we see one of the Redux usage options. We also do not forget about the usual HTML, CSS, JavaScript.",
	"eventer.p1": "In this interesting project, we see a site created where when we press the corresponding key on the keyboard, we hear different sounds of nature. On the screen is a list of keys to be pressed. When pressed, each key is illuminated. Also, on each key is written which sound will be played.",
	"eventer.p2": "The Event Listener technology is used here, with the help of which we bind the corresponding action to a certain key.",
	"generator.p1": "In this project I implemented a simple generator. When you press the Generate key, we generate a number, when you press it again, the number increases by 1. We can also change the font size of the generated number using two keys.",
	"generator.p2": "Here, pure JavaScript is used, with which we can create such a generator.",
	"home.title": "Taras <span>Kotovych</span>",
	"home.subtitle": "<span>Front-End</span> Developer",
	"home.link": "Get in Touch"
}