{
	"header.home": "Головна",
	"header.projects": "Проєкти",
	"header.skills": "Навички",
	"header.works": "Досвід роботи",
	"header.contacts": "Контакти",
	"cont.title": "Моє прагнення - досягати <span>винятковості</span> в усьому, що я роблю.",
	"cont.subtitle": "Нижче посилання на мої соціальні мережі<br/> Або пишіть сюди - <a style='color: wheat; font-family: Arial, 'Helvetica Neue', Helvetica, sans-serif; font-size: 16px;' className='main_mail' href='mailto:taraskotovych@gmail.com'>t.kotovych@gmail.com</a>",
	"about.hello": "Привіт Всім 👋",
	"about.title": "Мене звати Тарас<br/> Я Front-End <span>Розробник</span>",
	"about.subtitle": "Я пристрасний Front-End розробник з великим прагненням до інновацій і гострим поглядом на деталі. Моя подорож у веб-розробці підживлювалася глибокою любов’ю до створення красивих і зручних для користувача інтерфейсів. Я присвятив себе створенню ефективних, адаптивних та доступних веб-сайтів, які забезпечують виняткову взаємодію з користувачем. Маючи досвід як у дизайні, так і в кодуванні, я вношу унікальне поєднання креативності та технічного досвіду в кожен проект. Давайте працювати разом, щоб перетворити ваші ідеї на захоплюючий цифровий досвід.",
	"about.skills": "Мої навички",
	"work.title": "Мій Досвід",
	"work.description1": "На моїй посаді в «IT Global», я працював фронтенд-розробником протягом останніх трьох років. Я зосередився на створенні зручних інтерфейсів для найсучасніших веб-додатків. Серед моїх досягнень — розробка візуально привабливих веб-сторінок, які сприяли залученню користувачів і покращенню їх досвіду. Я ефективно співпрацював із міжфункціональними командами, включаючи дизайнерів і розробників серверної частини, щоб забезпечити якість і ефективність продукту. Я також активно досліджував і впроваджував нові технології та методи для підвищення ефективності розробки та забезпечення сумісності з різними браузерами та пристроями. Мій проактивний та адаптивний підхід сприяв моєму професійному зростанню та створенню високоякісних інноваційних продуктів.",
	"work.description2": "У «InfinitiTech Labs», я був фронтенд-розробником, який спеціалізувався на React і Redux. Моя роль включала перетворення концепцій дизайну на динамічні веб-інтерфейси. Я використовував React для створення інтерактивного досвіду користувача та інтегрував Redux для ефективного керування станом. Моя робота також включала оптимізацію продуктивності веб-сайту та забезпечення сумісності між браузерами та різними пристроями, сприяючи нашій репутації інноваційних цифрових рішень.",
	"work.description3": "Я досвідчений інтерфейсний розробник Upwork із успішним послужним списком понад рік. За цей час я взявся за різноманітні проекти, демонструючи свої знання в HTML, CSS, JavaScript, React і Redux. Моя робота охоплює від створення приголомшливих веб-інтерфейсів до оптимізації існуючих. Я прагну забезпечити якісні результати та забезпечити задоволення клієнтів. Давайте використаємо мій досвід для досягнення цілей вашого проекту.",
	"upwork.date": "10.10.2022 - дотепер",
	"projects.title": "Мої Проєкти",
	"projects1.subtitle":"Форма Реєстрації/Входу",
	"projects2.subtitle":"Реалізація Публікації Постів",
	"projects3.subtitle":"Слухач Подій",
	"projects4.subtitle":"Простий Генератор",
	"projects1.description": "У цьому проекті я навів простий приклад реалізації форми реєстрації/входу, яка перевіряє наявність і правильність введених даних.",
	"projects2.description": "Проєкт показує приклад реалізації можливого сайту, на якому є можливість додавання публікацій, які включають текст, картинку і тд. У проєкті використовується технологія Redux.",
	"projects3.description": "У цьому проекті використовується технологія слухача подій, за допомогою якої, при натисканні відповідної клавіші на клавіатурі, програється відповідний звук.",
	"projects4.description": "Тут показаний простий приклад генератора, за допомогою якого ми можемо генерувати новий індекс або змінювати розмір шрифту.",
	"projects.more": "Про проєкт...",
	"projects.visit": "Відвідати Проєкт",
	"sing.p1": "У цьому проекті показаний приклад реалізації форми реєстрації/входу. Форма перевіряє правильність введенних данних, запам'ятовує зареєстрованого користувача та в разі невідповідності повідомляє користувача.",
	"sing.p2": "Форма реалізована через React, за допомогою styled-components.",
	"publish.p1": "У цьому проекті я створив можливість додавання публікацій на сторінку. При публікаці також додається випадкова к-сть лайків, коментарів і поширень. При натисканні на кожну з них, число буде збільшуватися на 1, при повторному натисканні - зменшуватись.",
	"publish.p2": "Тут ми бачимо один з варіантів використання Redux. Також не забуваємо про звичні HTML, CSS, JavaScript.",
	"eventer.p1": "У цьому цікавому проекті ми бачимо створений сайт, де при натисканні на відповідну клавішу на клавіатурі, ми чуємо різні звуки природи. На екрані список клавіш, які потрібно натискати. При натисканні, кожна клавіша підсвічується. Також на кожній клавіші написано, який звук буде відтворюватися.",
	"eventer.p2": "Тут використана технологія Слухача Подій, за допомогою якої ми прив'язуємо відповідну дію до певної клавіші.",
	"generator.p1": "У цьому проекті я реалізував простий генератор. При натисканні на клавішу Генерувати, ми генеруємо число, при повторному натисканні, число збільшується на 1. Також ми може змінити розмір шрифту згенерованого числа за допомогою двох клавіш.",
	"generator.p2": "Тут використаний чистий JavaScript, за допомогою якого ми можемо створити такий генератор."
}