{
	"header.home": "Головна",
	"header.projects": "Проєкти",
	"header.skills": "Навички",
	"header.works": "Досвід роботи",
	"header.contacts": "Контакти",
	"cont.title": "Моє прагнення - досягати <span>винятковості</span> в усьому, що я роблю.",
	"cont.subtitle": "Нижче посилання на мої соціальні мережі<br/> Або пишіть сюди - <a style='color: wheat; font-family: Arial, 'Helvetica Neue', Helvetica, sans-serif; font-size: 16px;' className='main_mail' href='mailto:taraskotovych@gmail.com'>taraskotovych@gmail.com</a>",
	"about.hello": "Привіт Всім 👋",
	"about.title": "Мене звати Тарас<br/> Я Front-End <span>Розробник</span>",
	"about.subtitle": "Я пристрасний Front-End розробник з великим прагненням до інновацій і гострим поглядом на деталі. Моя подорож у веб-розробці підживлювалася глибокою любов’ю до створення красивих і зручних для користувача інтерфейсів. Я присвятив себе створенню ефективних, адаптивних та доступних веб-сайтів, які забезпечують виняткову взаємодію з користувачем. Маючи досвід як у дизайні, так і в кодуванні, я вношу унікальне поєднання креативності та технічного досвіду в кожен проект. Давайте працювати разом, щоб перетворити ваші ідеї на захоплюючий цифровий досвід.",
	"about.skills": "Мої навички",
	"work.title": "Мій Досвід",
	"work.description1": "На моїй посаді в «IT Global», я працював фронтенд-розробником протягом останніх трьох років. Я зосередився на створенні зручних інтерфейсів для найсучасніших веб-додатків. Серед моїх досягнень — розробка візуально привабливих веб-сторінок, які сприяли залученню користувачів і покращенню їх досвіду. Я ефективно співпрацював із міжфункціональними командами, включаючи дизайнерів і розробників серверної частини, щоб забезпечити якість і ефективність продукту. Я також активно досліджував і впроваджував нові технології та методи для підвищення ефективності розробки та забезпечення сумісності з різними браузерами та пристроями. Мій проактивний та адаптивний підхід сприяв моєму професійному зростанню та створенню високоякісних інноваційних продуктів.",
	"work.description2": "У «InfinitiTech Labs», я був фронтенд-розробником, який спеціалізувався на React і Redux. Моя роль включала перетворення концепцій дизайну на динамічні веб-інтерфейси. Я використовував React для створення інтерактивного досвіду користувача та інтегрував Redux для ефективного керування станом. Моя робота також включала оптимізацію продуктивності веб-сайту та забезпечення сумісності між браузерами та різними пристроями, сприяючи нашій репутації інноваційних цифрових рішень."
}